# Join Statements - Lab

## Introduction

In this lab, you'll practice your knowledge of `JOIN` statements, using various types of joins and various methods for specifying the links between them.

## Objectives

You will be able to:
* Write SQL queries that make use of various types of joins
* Compare and contrast the various types of joins
* Discuss how primary and foreign keys are used in SQL
* Decide and perform whichever type of join is best for retrieving desired data

## CRM Schema

In almost all cases, rather than just working with a single table you will typically need data from multiple tables. 
Doing this requires the use of **joins** using shared columns from the two tables. 

In this lab, you'll use the same customer relationship management (CRM) database that you saw from the previous lesson.
<img src='images/Database-Schema.png' width="600">

## Connecting to the Database
Import the necessary packages and connect to the database `'data.sqlite'`.

In [2]:
# Your code here
import sqlite3
import pandas as pd
cur = sqlite3.connect('data.sqlite').cursor()

## Display the names of all the employees in Boston 

Hint: join the employees and offices tables.

In [7]:
# Your code here
boston = pd.DataFrame(cur.execute("""SELECT lastName, firstName
                                    FROM employees
                                    JOIN offices
                                    USING(officeCode)
                                    WHERE offices.city = 'Boston';""").fetchall())
boston.columns = [x[0] for x in cur.description]
boston

    lastName firstName
0   Firrelli     Julie
1  Patterson     Steve

## Are there any offices that have zero employees?
Hint: Combine the employees and offices tables and use a group by.

In [32]:
# Your code here
zero = pd.DataFrame(cur.execute("""SELECT o.city, o.officeCode, COUNT(employeeNumber) AS number_employees
                                FROM offices AS o
                                LEFT JOIN employees AS e
                                USING(officeCode)
                                GROUP BY officeCode
                                HAVING number_employees == 0;""").fetchall())

zero.columns = [x[0] for x in cur.description]
zero

     city  officeCode  number_employees
0  Boston          27                 0

## Write 3 Questions of your own and answer them

In [ ]:
# Answers will vary
# Example: Display the htmlDescription and employee's first and last name for each product that each employee has sold

In [ ]:
# Your code here

In [ ]:
# Your code here

In [ ]:
# Your code here

## Level Up: Display the names of every individual product that each employee has sold

In [35]:
# Your code here

products = pd.DataFrame(cur.execute("""SELECT e.lastName, e.firstName, p.productName
                                        FROM employees AS e
                                        JOIN customers as c
                                        ON e.employeeNumber = c.salesRepEmployeeNumber
                                        JOIN orders as o
                                        USING(customernumber)
                                        JOIN orderdetails as od
                                        USING(orderNumber)
                                        JOIN products as p
                                        USING(productCode)""").fetchall())
products.columns = [x[0] for x in cur.description]
products

      lastName firstName                                  productName
0     Jennings    Leslie                               1958 Setra Bus
1     Jennings    Leslie                       1940 Ford Pickup Truck
2     Jennings    Leslie                      1939 Cadillac Limousine
3     Jennings    Leslie  1996 Peterbilt 379 Stake Bed with Outrigger
4     Jennings    Leslie                            1968 Ford Mustang
...        ...       ...                                          ...
2991    Gerard    Martin                  1954 Greyhound Scenicruiser
2992    Gerard    Martin       1950's Chicago Surface Lines Streetcar
2993    Gerard    Martin             Diamond T620 Semi-Skirted Tanker
2994    Gerard    Martin                           1911 Ford Town Car
2995    Gerard    Martin             1936 Mercedes Benz 500k Roadster

[2996 rows x 3 columns]

## Level Up: Display the Number of Products each employee has sold

In [50]:
# Your code here
numproducts = pd.DataFrame(cur.execute("""SELECT SUM(quantityOrdered) as total, e.lastName
                                            FROM employees AS e
                                            JOIN customers as c
                                            ON e.employeeNumber = c.salesRepEmployeeNumber
                                            JOIN orders as o
                                            USING(customerNumber)
                                            JOIN orderdetails as od
                                            USING(orderNumber)
                                            GROUP BY e.employeeNumber
                                            ORDER BY total DESC;""").fetchall())
numproducts.columns = [x[0] for x in cur.description]
numproducts


products.groupby(['lastName', 'firstName']).count().sort_values('productName', ascending=False)

                     productName
lastName  firstName
Hernandez Gerard             396
Jennings  Leslie             331
Castillo  Pamela             272
Bott      Larry              236
Jones     Barry              220
Vanauf    George             211
Fixter    Andy               185
Marsh     Peter              185
Bondur    Loui               177
Patterson Steve              152
Tseng     Foon Yue           142
Nishi     Mami               137
Firrelli  Julie              124
Gerard    Martin             114
Thompson  Leslie             114

## Summary

Congrats! You practiced using join statements and leveraged your foreign keys knowledge!